{
  "name": "Mustapha Moustahsane",
  "navHome": "Accueil",
  "navAbout": "À propos",
  "navWorks": "Projets",
  "navContact": "Contact",
  "HeadrLang": "Langue",
  "letsTalk": "Parlons-en",
  "footerRights": "Tous droits réservés par",
  "homeRole": "Développeur Full-Stack",
  "homeIntro": "Développeur Full-Stack basé à Casablanca, Maroc, avec 2 ans et demi d'expérience professionnelle. Spécialisé en .NET Core, Laravel, React et Angular. Passionné par la création d'applications web évolutives et de solutions innovantes.",
  "homeMarquee": "Derniers travaux et ",
  "homeFeatured": "En vedette",
  "homeMoreAbout": "En savoir plus",
  "homeCredentials": "Compétences",
  "homeShowcase": "Vitrine",
  "homeProjects": "Projets",
  "homeBlog": "GFonts Blog",
  "homeSpecialization": "Spécialisation",
  "homeServicesOffering": "Offre de services",
  "homeStayWithMe": "Restez avec moi",
  "homeProfiles": "Profils",
  "homeYearsExp": "Années\nd'expérience",
  "homeClients": "Clients\ndans le monde",
  "homeTotalProjects": "Total\nProjets",
  "homeLetsWork": "Travaillons ensemble.",
  "technicalSkills": "Compétences Techniques",
  "skillsFrontend": "Front-end",
  "skillsBackend": "Back-end / Frameworks",
  "skillsDatabases": "Bases de données & Modélisation",
  "skillsTools": "Outils & Workflow",
  "aboutMe": "À propos de moi",
  "aboutSelfSummary": "Résumé personnel",
  "aboutDescription": "Développeur Full-Stack avec 2 ans et demi d'expérience, basé à Casablanca, Maroc. Professionnel motivé et curieux, déterminé à approfondir ses compétences technologiques et à contribuer au succès d'une entreprise grâce à sa capacité d'adaptation. Spécialisé en développement web avec .NET Core, Laravel, React et Angular, ainsi qu'en architecture de bases de données et pratiques DevOps.",
  "phone": "+212 640-376131",
  "email": "moustahsanemustapha@gmail.com",
  "location": "Casablanca, Maroc",
  "portfolio": "https://rb.gy/l9qjbn",
  "contactMe": "Me contacter",
  "experience": "Expérience",
  "experience1Title": "Consultant Technique (Hybride)",
  "experience1Company": "Easy System 3000",
  "experience1Date": "Juillet 2023 - Aujourd'hui",
  "experience1Description": "Développement de l'application de gestion des ventes (ADV) pour la suite logicielle de promotion immobilière GECIMMO. Intégration d'interfaces, développement, déploiement et maintenance de la base de données et de la solution globale.",
  "experience2Title": "Stage Développeur Laravel",
  "experience2Company": "Gecimmo",
  "experience2Date": "Mars 2023 - Avril 2023",
  "experience2Description": "Développement d'une application externe de gestion des demandes de remise. Saisie et traitement des demandes (acceptation/refus avec motifs) selon un processus prédéfini. Génération de rapports détaillés sur les demandeurs et les décisions prises.",
  "education": "Formation",
  "education1Title": "Baccalauréat sciences de vie et de terre",
  "education1Institution": "Lycée Abdelkrim El Khattabi / Casablanca",
  "education1Description": "L'obtention d'un baccalauréat représente l'aboutissement d'années d'efforts et de détermination. C'est bien plus qu'un simple diplôme : c'est le symbole de la persévérance et de la volonté de réussir. Ce jalon marque le début d'une nouvelle phase, ouvrant la voie à de nombreuses opportunités tant sur le plan académique que professionnel.",
  "education1bTitle": "Berufsausbildung in Systemintegration",
  "education1bInstitution": "ISTAG – Sidi Moumen – Casablanca, Maroc",
  "education1bDescription": "Formation pratique et théorique en intégration de systèmes, incluant la gestion de réseaux, configuration des serveurs et résolution de problèmes techniques dans un environnement professionnel.",
  "education2Title": "Diplôme de technicien spécialisé en développement digital",
  "education2Institution": "ISTA CFP MGD HASSANIA (DTS)",
  "education2Description": "L'obtention d'un diplôme de technicien spécialisé en développement digital (Fullstack) marque une étape majeure dans une carrière axée sur la technologie. C'est le résultat d'un dévouement intense et d'une passion pour l'innovation numérique. Ce diplôme ouvre les portes à un large éventail d'opportunités professionnelles, permettant aux diplômés de mettre en pratique leurs compétences pour créer des solutions numériques robustes et créatives.",
  "education3Title": "Licence professionnelle DevOps and full stack development",
  "education3Institution": "Faculté des sciences Ain Chock",
  "education3Description": "L'obtention d'une Licence professionnelle en DevOps et développement full stack marque une étape cruciale dans une carrière axée sur la technologie. Ce diplôme témoigne d'une double compétence, combinant expertise en développement d'applications web et pratiques DevOps pour une livraison logicielle optimisée. C'est le résultat d'un engagement soutenu et d'une formation rigoureuse, ouvrant la voie à des opportunités professionnelles stimulantes dans le domaine du développement logiciel moderne.",
  "skills": "Compétences",
  "skillDescription": "Non enim praesent",
  "awards": "Récompenses",
  "awardDescription": "Non enim praesent",
  "present": "Aujourd'hui",
  "contactInfo": "Coordonnées",
  "contactMailUs": "Envoyez-nous un mail",
  "contactCallUs": "Appelez-nous",
  "contactLocation": "Localisation",
  "contactSocialInfo": "Réseaux sociaux",
  "contactLetsWork": "Travaillons ensemble.",
  "contactMessageSent": "Votre message a été envoyé avec succès.",
  "contactName": "Votre nom",
  "contactEmail": "Votre email",
  "contactSubject": "Sujet",
  "contactMessage": "Votre message",
  "contactSend": "Envoyer le message",
  "serviceMyOfferings": "Mes Offres",
  "serviceDbDesign": "Conception de Bases de Données",
  "serviceDbDesignDesc": "Architecture et modélisation experte de bases de données. Je conçois des schémas normalisés et évolutifs, optimisés pour la performance, garantissant l'intégrité des données et une exécution efficace des requêtes pour vos applications.",
  "serviceProjectMgmt": "Gestion de Projet",
  "serviceProjectMgmtDesc": "Coordination de projet de bout en bout avec les méthodologies Agile et Scrum. J'assure une communication claire, des livraisons dans les délais et une collaboration fluide entre les équipes de développement et les parties prenantes.",
  "serviceFigma": "Design Figma",
  "serviceFigmaDesc": "Conception UI/UX créative avec Figma. Je crée des interfaces modernes et intuitives avec des prototypes interactifs, des systèmes de design et des mises en page responsives offrant des expériences utilisateur exceptionnelles.",
  "serviceDevelopment": "Développement Web",
  "serviceDevelopmentDesc": "Développement web full-stack avec des technologies modernes comme Next.js, React, Node.js et plus encore. Je construis des applications web performantes, responsives et évolutives du front-end au back-end.",
  "worksAllProjects": "Tous les Projets",
  "projectAbout": "À propos",
  "projectYear": "Année",
  "projectClient": "Client",
  "projectServices": "Services",
  "projectType": "Projet",
  "projectDescription": "Description",
  "nextProject": "Projet suivant",
  "viewAllProjects": "Voir tous les projets",
  "project1StudioName": "FieldBook",
  "project1StudioDescription1": "Une plateforme web complète conçue pour révolutionner la façon dont les amateurs de football réservent et gèrent la location de terrains. Le système connecte les propriétaires de terrains avec les joueurs grâce à une interface intuitive et conviviale qui simplifie l'ensemble du processus de réservation, de la recherche au paiement.",
  "project1StudioDescription2": "Construit avec des technologies web modernes, FieldBook offre un suivi de disponibilité en temps réel, un traitement sécurisé des paiements et une génération automatique de codes QR pour un accès transparent aux terrains. La plateforme prend en charge à la fois les propriétaires de terrains et les joueurs avec des tableaux de bord personnalisés qui offrent une visibilité complète sur les réservations, les revenus et l'utilisation des terrains.",
  "project1AboutDescription1": "FieldBook est une plateforme de réservation en ligne qui permet aux utilisateurs de découvrir et de louer des terrains de football à proximité à l'heure. L'application dispose d'un système de double compte destiné aux propriétaires de terrains et aux joueurs, avec des outils de gestion complets pour chaque type d'utilisateur.",
  "project1AboutDescription2": "Les propriétaires de terrains peuvent télécharger des photos, gérer la disponibilité et suivre les réservations via un tableau de bord avancé avec des statistiques détaillées. Les joueurs peuvent parcourir les terrains disponibles, sélectionner leurs créneaux horaires préférés, effectuer des réservations sécurisées et recevoir des reçus numériques avec codes QR pour la vérification d'entrée. Le système fournit une gestion des réservations en temps réel et des analyses complètes pour le suivi des performances des terrains.",
  "project1Client": "Gestion d'installations sportives",
  "project1Services": "Développement Web Full-Stack",
  "project1ProjectType": "Plateforme de réservation",
  "project1DetailsDescription1": "La plateforme dispose d'un système d'authentification robuste avec deux rôles d'utilisateur distincts : les propriétaires de terrains qui peuvent gérer plusieurs sites, télécharger des images de haute qualité, définir les prix et surveiller les réservations via des tableaux de bord complets ; et les joueurs qui peuvent rechercher des terrains en fonction de l'emplacement, consulter des informations détaillées incluant photos et disponibilités, sélectionner des créneaux horaires, effectuer des paiements sécurisés et recevoir des reçus numériques avec code QR pour l'accès au terrain.",
  "project1DetailsDescription2": "FieldBook intègre des fonctionnalités avancées incluant des calendriers de disponibilité en temps réel, des e-mails de confirmation de réservation automatisés, la génération de codes QR pour la vérification d'entrée, l'intégration de passerelles de paiement et des tableaux de bord d'analyse complets. Le panneau d'administration fournit aux propriétaires de terrains des informations sur les tendances de réservation, les statistiques de revenus, les heures de pointe d'utilisation et les données démographiques des clients, permettant des décisions commerciales basées sur les données et une gestion optimisée des terrains.",
  "project2StudioName": "QRMaster",
  "project2StudioDescription1": "QRMaster est une application web polyvalente conçue pour simplifier la création, la personnalisation et la gestion des QR codes. Elle permet de convertir n'importe quel texte, lien ou donnée en QR code professionnel, tout en offrant un contrôle total sur la taille, les couleurs et le format.",
  "project2StudioDescription2": "Grâce aux technologies web modernes, QRMaster propose une interface intuitive, une génération instantanée de QR codes et des options d'export flexibles en PNG ou SVG. Le système inclut également un lecteur puissant capable de scanner des QR codes à partir d'images ou via la caméra, avec décodage immédiat du contenu.",
  "project2AboutDescription1": "QRMaster est une plateforme de gestion de QR codes adaptée aux particuliers comme aux entreprises. Elle permet de créer, personnaliser et lire des QR codes en quelques secondes, avec une maîtrise complète du design, de l'apparence et du format d'export.",
  "project2AboutDescription2": "Les utilisateurs peuvent générer des QR codes à partir de textes ou d'URLs, ajuster couleurs et dimensions, puis les télécharger en PNG ou SVG. L'application inclut aussi un lecteur intégré capable de scanner des QR codes via une image ou la caméra. Toutes les actions sont sauvegardées automatiquement dans l'historique, séparé en deux catégories : 'Générés' et 'Lus'.",
  "project2Client": "Outils numériques & Productivité",
  "project2Services": "Développement Web Full-Stack & UI/UX",
  "project2ProjectType": "Plateforme de Génération et Lecture de QR Codes",
  "project2DetailsDescription1": "La plateforme offre un tableau de bord dynamique permettant de créer et personnaliser des QR codes avec précision. Les utilisateurs peuvent choisir les couleurs, les styles, les formats d'export et télécharger les codes générés. Le lecteur QR décode instantanément des images ou des flux caméra.",
  "project2DetailsDescription2": "QRMaster enregistre automatiquement l'historique complet dans la base de données, classé en deux sections : QR codes générés et QR codes lus. Les utilisateurs peuvent les consulter, les gérer ou les télécharger à tout moment. Grâce à son architecture moderne, la plateforme garantit performance, ergonomie et compatibilité sur tous les appareils.",
  "project3StudioName": "Système de Gestion Scolaire",
  "project3StudioDescription1": "Un système complet de gestion scolaire qui gère toutes les opérations académiques et administratives de A à Z. Le système gère les enseignants, les élèves, les présences, les absences, les horaires, les vacances, les examens, la notation et les dossiers académiques.",
  "project3StudioDescription2": "Il centralise toutes les activités scolaires sur une seule plateforme pour simplifier l'administration et améliorer l'organisation et la communication. Construit avec des technologies modernes, ce système offre des mises à jour en temps réel, des notifications automatiques et des capacités de reporting détaillées pour les établissements d'enseignement.",
  "project3AboutDescription1": "Ce système de gestion scolaire est conçu pour rationaliser tous les aspects de la gestion des établissements d'enseignement. Il fournit des modules dédiés pour la gestion des enseignants, l'inscription des élèves, le suivi des présences, la planification académique et la gestion des examens.",
  "project3AboutDescription2": "La plateforme offre un accès basé sur les rôles pour les administrateurs, les enseignants et les parents, garantissant un accès sécurisé et approprié aux informations. Elle inclut des fonctionnalités pour les notifications d'absence, la gestion des notes, la génération de bulletins scolaires et des analyses complètes pour suivre les performances des élèves et les indicateurs institutionnels.",
  "project3Client": "Établissement d'Enseignement",
  "project3Services": "Développement Enterprise Full-Stack",
  "project3ProjectType": "Plateforme de Gestion Scolaire",
  "project3DetailsDescription1": "Le système comprend des modules complets incluant la gestion des enseignants et des élèves, le suivi automatisé des présences avec alertes d'absence, la gestion dynamique des emplois du temps pour les cours et les examens, l'intégration du calendrier des vacances et un système complet de notation avec génération de bulletins scolaires.",
  "project3DetailsDescription2": "Les fonctionnalités avancées incluent les notifications en temps réel pour les parents, l'analyse des performances académiques, les statistiques de présence, la gestion de la charge de travail des enseignants et la génération automatique de rapports. La plateforme prend en charge plusieurs rôles d'utilisateurs avec des permissions personnalisables, garantissant la sécurité des données et des niveaux d'accès appropriés pour toutes les parties prenantes du processus éducatif.",
  "project4StudioName": "Easy Tasks - Système de Gestion des Tâches",
  "project4StudioDescription1": "Easy Tasks est une plateforme sophistiquée de gestion de tickets B2B SaaS conçue pour les agences de développement logiciel gérant plusieurs projets clients. Développée pour Gecimmo afin de gérer efficacement les tâches, les demandes de fonctionnalités et le suivi des bugs à travers divers engagements clients.",
  "project4StudioDescription2": "La plateforme fournit un contrôle d'accès basé sur les rôles, des flux de travail multi-étapes, des notifications automatisées et un suivi complet des demandes de fonctionnalités et des bugs à travers différents modules et organisations. Elle rationalise la gestion de projet et améliore la collaboration d'équipe grâce au routage intelligent des tâches et à la gestion des statuts.",
  "project4AboutDescription1": "Easy Tasks met l'accent sur la collaboration entre les clients, les chefs de projet, les développeurs et les analystes fonctionnels à travers un processus d'approbation et de livraison bien défini. Le système permet une communication et un suivi transparents tout au long du cycle de vie complet du ticket.",
  "project4AboutDescription2": "Conçue avec l'évolutivité à l'esprit, la plateforme gère simultanément plusieurs organisations, projets et modules. Elle propose une affectation intelligente des tickets, une gestion des priorités, un suivi des délais et des tableaux de bord de reporting complets qui fournissent des informations en temps réel sur l'avancement des projets et les performances de l'équipe.",
  "project4Client": "Gecimmo / Agences de Développement Logiciel",
  "project4Services": "Développement de Plateforme SaaS B2B",
  "project4ProjectType": "Plateforme de Gestion de Tickets",
  "project4DetailsDescription1": "Le système propose un contrôle d'accès basé sur les rôles avec des permissions distinctes pour les clients, les chefs de projet, les développeurs et les analystes fonctionnels. Il comprend des flux de travail multi-étapes pour l'approbation, le développement, les tests et la livraison des tickets. Les notifications par e-mail automatisées tiennent les parties prenantes informées à chaque étape du processus.",
  "project4DetailsDescription2": "Les capacités avancées incluent la catégorisation des tickets par type (demande de fonctionnalité, bug, amélioration), l'organisation basée sur les modules, les niveaux de priorité avec suivi des SLA, la prise en charge des pièces jointes, les fils de discussion pour les commentaires, l'historique des activités et des flux de travail de statut personnalisables. La plateforme fournit des analyses complètes sur les temps de résolution des tickets, la productivité de l'équipe, les métriques de satisfaction client et les indicateurs de santé des projets, permettant une prise de décision basée sur les données pour la gestion de projet."
}