{
  "name": "Mustapha Moustahsane",
  "navHome": "Startseite",
  "navAbout": "Über mich",
  "navWorks": "Projekte",
  "navContact": "Kontakt",
  "HeadrLang": "Sprache",
  "letsTalk": "Lass uns reden",
  "footerRights": "Alle Rechte vorbehalten von",
  "homeRole": "Full-Stack Entwickler",
  "homeIntro": "Full-Stack Entwickler mit Sitz in Casablanca, Marokko, mit 2,5 Jahren Berufserfahrung. Spezialisiert auf .NET Core, Laravel, React und Angular. Leidenschaftlich interessiert am Aufbau skalierbarer Webanwendungen und innovativer Lösungen.",
  "homeMarquee": "Neueste Arbeiten und ",
  "homeFeatured": "Highlights",
  "homeMoreAbout": "Mehr über mich",
  "homeCredentials": "Referenzen",
  "homeShowcase": "Ausstellung",
  "homeProjects": "Projekte",
  "homeBlog": "GFonts Blog",
  "homeSpecialization": "Spezialisierung",
  "homeServicesOffering": "Dienstleistungsangebot",
  "homeStayWithMe": "Bleib in Kontakt",
  "homeProfiles": "Profile",
  "homeYearsExp": "Jahre\nErfahrung",
  "homeClients": "Kunden\nweltweit",
  "homeTotalProjects": "Gesamt\nProjekte",
  "homeLetsWork": "Lass uns zusammenarbeiten.",
  "technicalSkills": "Technische Fähigkeiten",
  "skillsFrontend": "Front-end",
  "skillsBackend": "Back-end / Frameworks",
  "skillsDatabases": "Datenbanken & Modellierung",
  "skillsTools": "Tools & Workflow",
  "aboutMe": "Über mich",
  "aboutSelfSummary": "Persönliches Profil",
  "aboutDescription": "Full-Stack Entwickler mit 2,5 Jahren Erfahrung, ansässig in Casablanca, Marokko. Motivierter und neugieriger Fachmann, entschlossen, technische Fähigkeiten zu vertiefen und durch Anpassungsfähigkeit zum Erfolg eines Unternehmens beizutragen. Spezialisiert auf Webentwicklung mit .NET Core, Laravel, React und Angular sowie auf Datenbankarchitektur und DevOps-Praktiken.",
  "phone": "+212 640-376131",
  "email": "moustahsanemustapha@gmail.com",
  "location": "Casablanca, Marokko",
  "portfolio": "https://rb.gy/l9qjbn",
  "contactMe": "Kontaktieren Sie mich",
  "experience": "Erfahrung",
  "experience1Title": "Technischer Berater (Hybrid)",
  "experience1Company": "Easy System 3000",
  "experience1Date": "Juli 2023 - Heute",
  "experience1Description": "Entwicklung der Vertriebsverwaltungsanwendung (ADV) für die GECIMMO Immobilienförderungs-Softwaresuite. Schnittstellenintegration, Entwicklung, Bereitstellung und Wartung der Datenbank und der Gesamtlösung.",
  "experience2Title": "Laravel-Entwickler Praktikant",
  "experience2Company": "Gecimmo",
  "experience2Date": "März 2023 - April 2023",
  "experience2Description": "Entwicklung einer externen Anwendung zur Verwaltung von Rabattanfragen. Erfassung und Bearbeitung von Anfragen (Annahme/Ablehnung mit Begründung) nach einem vordefinierten Prozess. Erstellung detaillierter Berichte über Antragsteller und getroffene Entscheidungen.",
  "education": "Bildung",
  "education1Title": "Abitur in Lebens- und Geowissenschaften",
  "education1Institution": "Lycée Abdelkrim El Khattabi / Casablanca",
  "education1Description": "Der Erwerb des Abiturs stellt den Höhepunkt jahrelanger Anstrengungen und Entschlossenheit dar. Es ist viel mehr als nur ein Diplom: Es ist ein Symbol für Ausdauer und den Willen zum Erfolg. Dieser Meilenstein markiert den Beginn einer neuen Phase und eröffnet viele Möglichkeiten sowohl im akademischen als auch im beruflichen Bereich.",
  "education1bTitle": "Ausbildung in IT-Netzwerken und Telekommunikation",
  "education1bInstitution": "ISTAG – Sidi Moumen – Casablanca, Marokko",
  "education1bDescription": "Berufliche praktische und theoretische Ausbildung in IT-Netzwerken und Telekommunikation, einschließlich Netzwerkverwaltung und -konfiguration, Serververwaltung, IT-Sicherheit und technischer Problemlösung in einem professionellen Umfeld.",
  "education2Title": "Diplom als Fachtechniker für digitale Entwicklung",
  "education2Institution": "ISTA CFP MGD HASSANIA (DTS)",
  "education2Description": "Der Erwerb eines Diploms als Fachtechniker für digitale Entwicklung (Fullstack) markiert einen wichtigen Schritt in einer technologieorientierten Karriere. Es ist das Ergebnis intensiver Hingabe und einer Leidenschaft für digitale Innovation. Dieses Diplom eröffnet ein breites Spektrum an Berufschancen und ermöglicht es den Absolventen, ihre Fähigkeiten in die Praxis umzusetzen, um robuste und kreative digitale Lösungen zu schaffen.",
  "education3Title": "Berufsabschluss in DevOps und Full-Stack-Entwicklung",
  "education3Institution": "Faculty of Sciences Ain Chock",
  "education3Description": "Der Erwerb eines Berufsabschlusses in DevOps und Full-Stack-Entwicklung markiert einen entscheidenden Schritt in einer technologieorientierten Karriere. Dieses Diplom bezeugt doppelte Expertise, die Webanwendungsentwicklung mit DevOps-Praktiken für optimierte Softwarebereitstellung kombiniert. Es ist das Ergebnis anhaltenden Engagements und rigoroser Ausbildung und eröffnet Wege zu anregenden beruflichen Möglichkeiten im Bereich der modernen Softwareentwicklung.",
  "skills": "Fähigkeiten",
  "skillDescription": "Non enim praesent",
  "awards": "Auszeichnungen",
  "awardDescription": "Non enim praesent",
  "present": "Heute",
  "contactInfo": "Kontaktinformationen",
  "contactMailUs": "Schreiben Sie uns",
  "contactCallUs": "Rufen Sie uns an",
  "contactLocation": "Standort",
  "contactSocialInfo": "Soziale Netzwerke",
  "contactLetsWork": "Lass uns zusammenarbeiten.",
  "contactMessageSent": "Ihre Nachricht wurde erfolgreich gesendet.",
  "contactName": "Ihr Name",
  "contactEmail": "Ihre E-Mail",
  "contactSubject": "Betreff",
  "contactMessage": "Ihre Nachricht",
  "contactSend": "Nachricht senden",
  "serviceMyOfferings": "Meine Angebote",
  "serviceDbDesign": "Datenbankdesign",
  "serviceDbDesignDesc": "Experten-Datenbankarchitektur und -modellierung. Ich entwerfe skalierbare, normalisierte Datenbankschemata, die auf Leistung optimiert sind und Datenintegrität sowie effiziente Abfrageausführung für Ihre Anwendungen gewährleisten.",
  "serviceProjectMgmt": "Projektmanagement",
  "serviceProjectMgmtDesc": "End-to-End-Projektkoordination mit Agile- und Scrum-Methoden. Ich sorge für klare Kommunikation, pünktliche Lieferungen und reibungslose Zusammenarbeit zwischen Entwicklungsteams und Stakeholdern.",
  "serviceFigma": "Figma-Design",
  "serviceFigmaDesc": "Kreatives UI/UX-Design mit Figma. Ich gestalte intuitive, moderne Oberflächen mit interaktiven Prototypen, Designsystemen und responsiven Layouts, die außergewöhnliche Benutzererlebnisse bieten.",
  "serviceDevelopment": "Webentwicklung",
  "serviceDevelopmentDesc": "Full-Stack-Webentwicklung mit modernen Technologien wie Next.js, React, Node.js und mehr. Ich entwickle leistungsstarke, responsive und skalierbare Webanwendungen vom Frontend bis zum Backend.",
  "worksAllProjects": "Alle Projekte",
  "projectAbout": "Über",
  "projectYear": "Jahr",
  "projectClient": "Kunde",
  "projectServices": "Dienstleistungen",
  "projectType": "Projekt",
  "projectDescription": "Beschreibung",
  "nextProject": "Nächstes Projekt",
  "viewAllProjects": "Alle Projekte anzeigen",
  "project1StudioName": "FieldBook",
  "project1StudioDescription1": "Eine umfassende Webplattform, die entwickelt wurde, um die Art und Weise zu revolutionieren, wie Fußballbegeisterte Platzvermietungen buchen und verwalten. Das System verbindet Platzbesitzer mit Spielern durch eine intuitive, benutzerfreundliche Oberfläche, die den gesamten Buchungsprozess von der Suche bis zur Zahlung vereinfacht.",
  "project1StudioDescription2": "Aufgebaut mit modernen Webtechnologien bietet FieldBook Echtzeit-Verfügbarkeitsverfolgung, sichere Zahlungsabwicklung und automatisierte QR-Code-Generierung für nahtlosen Platzzugang. Die Plattform unterstützt sowohl Platzbesitzer als auch Spieler mit maßgeschneiderten Dashboards, die vollständige Transparenz über Buchungen, Einnahmen und Platzauslastung bieten.",
  "project1AboutDescription1": "FieldBook ist eine webbasierte Buchungsplattform, die es Benutzern ermöglicht, nahegelegene Fußballplätze stundenweise zu entdecken und zu mieten. Die Anwendung verfügt über ein Dual-Account-System für Platzbesitzer und Spieler mit umfassenden Verwaltungstools für jeden Benutzertyp.",
  "project1AboutDescription2": "Platzbesitzer können Fotos hochladen, die Verfügbarkeit verwalten und Buchungen über ein erweitertes Dashboard mit detaillierten Statistiken verfolgen. Spieler können verfügbare Plätze durchsuchen, bevorzugte Zeitfenster auswählen, sichere Buchungen vornehmen und digitale Quittungen mit QR-Codes zur Eingangsüberprüfung erhalten. Das System bietet Echtzeit-Buchungsverwaltung und umfassende Analysen zur Verfolgung der Platzleistung.",
  "project1Client": "Sportstättenverwaltung",
  "project1Services": "Full-Stack Webentwicklung",
  "project1ProjectType": "Buchungsplattform",
  "project1DetailsDescription1": "Die Plattform verfügt über ein robustes Authentifizierungssystem mit zwei unterschiedlichen Benutzerrollen: Platzbesitzer, die mehrere Standorte verwalten, hochwertige Bilder hochladen, Preise festlegen und Buchungen über umfassende Dashboards überwachen können; und Spieler, die nach Plätzen basierend auf dem Standort suchen, detaillierte Informationen einschließlich Fotos und Verfügbarkeit anzeigen, Zeitfenster auswählen, sichere Zahlungen abschließen und digitale Quittungen mit QR-Code für den Platzzugang erhalten können.",
  "project1DetailsDescription2": "FieldBook integriert erweiterte Funktionen wie Echtzeit-Verfügbarkeitskalender, automatisierte Buchungsbestätigungs-E-Mails, QR-Code-Generierung zur Eingangsüberprüfung, Zahlungsgateway-Integration und umfassende Analyse-Dashboards. Das Admin-Panel bietet Platzbesitzern Einblicke in Buchungstrends, Umsatzstatistiken, Spitzennutzungszeiten und Kundendemografie und ermöglicht datengesteuerte Geschäftsentscheidungen und optimierte Platzverwaltung.",
  "project2StudioName": "QRMaster",
  "project2StudioDescription1": "Eine vielseitige Webanwendung, die entwickelt wurde, um die Erstellung, Personalisierung und Verwaltung von QR-Codes zu vereinfachen. Das System ermöglicht es Benutzern, jeden beliebigen Text, Link oder andere Daten in einen professionellen QR-Code umzuwandeln und dabei Größe, Farben und Format vollständig anzupassen.",
  "project2StudioDescription2": "Dank moderner Webtechnologien bietet QRMaster eine intuitive Benutzeroberfläche, sofortige QR-Code-Generierung und flexible Exportoptionen in PNG oder SVG. Zusätzlich verfügt das System über eine leistungsstarke QR-Code-Scan-Funktion, die sowohl Bilder als auch Live-Kameraeingaben unterstützt und dem Benutzer sofort den entschlüsselten Inhalt liefert.",
  "project2AboutDescription1": "QRMaster ist ein benutzerfreundliches QR-Code-Managementsystem, das sowohl für private Anwender als auch für Unternehmen entwickelt wurde. Die Anwendung ermöglicht das Erstellen, Personalisieren und Lesen von QR-Codes in wenigen Sekunden, mit umfassender Kontrolle über Design, Darstellung und Dateiformat.",
  "project2AboutDescription2": "Benutzer können QR-Codes aus Texten, URLs oder beliebigen Daten generieren, Farben und Größen anpassen und die Codes als PNG oder SVG herunterladen. Darüber hinaus bietet QRMaster einen integrierten QR-Reader, der Inhalte aus hochgeladenen Bildern oder der Kamera extrahiert. Alle Aktivitäten werden automatisch im Verlauf gespeichert und getrennt als 'Generiert' und 'Gelesen' klassifiziert.",
  "project2Client": "Digital Tooling & Productivity",
  "project2Services": "Full-Stack Webentwicklung & UI/UX",
  "project2ProjectType": "QR-Code Generator & Scanner Plattform",
  "project2DetailsDescription1": "Die Plattform verfügt über ein dynamisches Dashboard, das Benutzern ermöglicht, QR-Codes präzise zu erstellen und individuell anzupassen. Farbauswahl, Hintergrunddesign, Formateinstellungen und Exportfunktionen sind vollständig integriert. Der QR-Reader analysiert effizient sowohl hochgeladene Bilder als auch Live-Kamerastreams und liefert sofort das dekodierte Ergebnis.",
  "project2DetailsDescription2": "QRMaster speichert den gesamten Verlauf automatisch in der Datenbank und trennt ihn in zwei Kategorien: generierte QR-Codes und gelesene QR-Codes. Benutzer können ihre Historie jederzeit einsehen, verwalten oder erneut herunterladen. Dank moderner Technologien bietet die Plattform hohe Performance, ein sauberes UI/UX-Design und volle Kompatibilität über verschiedene Geräte hinweg.",
  "project3StudioName": "Schulverwaltungssystem",
  "project3StudioDescription1": "Ein umfassendes Schulverwaltungssystem, das alle akademischen und administrativen Vorgänge von A bis Z abwickelt. Das System verwaltet Lehrer, Schüler, Anwesenheit, Abwesenheiten, Stundenpläne, Ferien, Prüfungen, Notenvergabe und akademische Aufzeichnungen.",
  "project3StudioDescription2": "Es zentralisiert alle schulischen Aktivitäten auf einer Plattform, um die Verwaltung zu vereinfachen und Organisation sowie Kommunikation zu verbessern. Gebaut mit modernen Technologien bietet dieses System Echtzeit-Updates, automatisierte Benachrichtigungen und detaillierte Berichtsfunktionen für Bildungseinrichtungen.",
  "project3AboutDescription1": "Dieses Schulverwaltungssystem wurde entwickelt, um alle Aspekte der Verwaltung von Bildungseinrichtungen zu rationalisieren. Es bietet dedizierte Module für Lehrerverwaltung, Schüleranmeldung, Anwesenheitsverfolgung, akademische Planung und Prüfungsverwaltung.",
  "project3AboutDescription2": "Die Plattform bietet rollenbasierten Zugriff für Administratoren, Lehrer und Eltern und gewährleistet sicheren und angemessenen Zugang zu Informationen. Sie umfasst Funktionen für Abwesenheitsbenachrichtigungen, Notenverwaltung, Zeugnisgenerierung und umfassende Analysen zur Verfolgung der Schülerleistung und institutioneller Kennzahlen.",
  "project3Client": "Bildungseinrichtung",
  "project3Services": "Full-Stack Enterprise-Entwicklung",
  "project3ProjectType": "Schulverwaltungsplattform",
  "project3DetailsDescription1": "Das System verfügt über umfassende Module einschließlich Lehrer- und Schülerverwaltung, automatisierter Anwesenheitsverfolgung mit Abwesenheitsalarmen, dynamischer Stundenplanverwaltung für Unterricht und Prüfungen, Ferienkalenderintegration und einem vollständigen Notensystem mit Zeugnisgenerierung.",
  "project3DetailsDescription2": "Erweiterte Funktionen umfassen Echtzeit-Elternbenachrichtigungen, akademische Leistungsanalysen, Anwesenheitsstatistiken, Lehrarbeitslastverwaltung und automatisierte Berichtserstellung. Die Plattform unterstützt mehrere Benutzerrollen mit anpassbaren Berechtigungen und gewährleistet Datensicherheit und angemessene Zugriffsebenen für alle Beteiligten im Bildungsprozess.",
  "project4StudioName": "Easy Tasks - Aufgabenverwaltungssystem",
  "project4StudioDescription1": "Easy Tasks ist eine ausgefeilte B2B-SaaS-Ticket-Management-Plattform, die für Softwareentwicklungsagenturen entwickelt wurde, die mehrere Kundenprojekte verwalten. Entwickelt für Gecimmo zur effizienten Verwaltung von Aufgaben, Feature-Anfragen und Bug-Tracking über verschiedene Kundenengagements hinweg.",
  "project4StudioDescription2": "Die Plattform bietet rollenbasierte Zugriffskontrolle, mehrstufige Workflows, automatisierte Benachrichtigungen und umfassende Verfolgung von Feature-Anfragen und Bugs über verschiedene Module und Organisationen hinweg. Sie optimiert das Projektmanagement und verbessert die Teamzusammenarbeit durch intelligentes Aufgaben-Routing und Statusverwaltung.",
  "project4AboutDescription1": "Easy Tasks legt Wert auf die Zusammenarbeit zwischen Kunden, Projektmanagern, Entwicklern und funktionalen Analysten durch einen klar definierten Genehmigungs- und Lieferprozess. Das System ermöglicht nahtlose Kommunikation und Verfolgung während des gesamten Ticket-Lebenszyklus.",
  "project4AboutDescription2": "Mit Blick auf Skalierbarkeit konzipiert, verwaltet die Plattform gleichzeitig mehrere Organisationen, Projekte und Module. Sie bietet intelligente Ticket-Zuweisung, Prioritätsverwaltung, Deadline-Verfolgung und umfassende Berichts-Dashboards, die Echtzeit-Einblicke in Projektfortschritt und Teamleistung bieten.",
  "project4Client": "Gecimmo / Softwareentwicklungsagenturen",
  "project4Services": "B2B-SaaS-Plattformentwicklung",
  "project4ProjectType": "Ticket-Management-Plattform",
  "project4DetailsDescription1": "Das System verfügt über rollenbasierte Zugriffskontrolle mit unterschiedlichen Berechtigungen für Kunden, Projektmanager, Entwickler und funktionale Analysten. Es umfasst mehrstufige Workflows für Ticket-Genehmigung, Entwicklung, Tests und Auslieferung. Automatisierte E-Mail-Benachrichtigungen halten die Beteiligten in jeder Phase des Prozesses informiert.",
  "project4DetailsDescription2": "Erweiterte Fähigkeiten umfassen Ticket-Kategorisierung nach Typ (Feature-Anfrage, Bug, Verbesserung), modulbasierte Organisation, Prioritätsstufen mit SLA-Verfolgung, Unterstützung für Dateianhänge, Kommentar-Threads für Diskussionen, Aktivitätsverlaufsprotokollierung und anpassbare Status-Workflows. Die Plattform bietet umfassende Analysen zu Ticket-Lösungszeiten, Teamproduktivität, Kundenzufriedenheitsmetriken und Projektgesundheitsindikatoren, die datengesteuerte Entscheidungsfindung für das Projektmanagement ermöglichen."
}