{
  "name": "Mustapha Moustahsane",
  "navHome": "Home",
  "navAbout": "About",
  "navWorks": "Works",
  "navContact": "Contact",
  "HeadrLang": "Language",
  "letsTalk": "Let's talk",
  "footerRights": "All rights reserved by",
  "homeRole": "Full-Stack Developer",
  "homeIntro": "Full-Stack developer based in Casablanca, Morocco, with 2.5 years of professional experience. Specialized in .NET Core, Laravel, React, and Angular. Passionate about building scalable web applications and innovative solutions.",
  "homeMarquee": "Latest Work and ",
  "homeFeatured": "Featured",
  "homeMoreAbout": "More about me",
  "homeCredentials": "Credentials",
  "homeShowcase": "Showcase",
  "homeProjects": "Projects",
  "homeBlog": "GFonts Blog",
  "homeSpecialization": "Specialization",
  "homeServicesOffering": "Services Offering",
  "homeStayWithMe": "Stay with me",
  "homeProfiles": "Profiles",
  "homeYearsExp": "Years\nExperience",
  "homeClients": "Clients\nWorldwide",
  "homeTotalProjects": "Total\nProjects",
  "homeLetsWork": "Let's work together.",
  "technicalSkills": "Technical Skills",
  "skillsFrontend": "Front-end",
  "skillsBackend": "Back-end / Frameworks",
  "skillsDatabases": "Databases & Modeling",
  "skillsTools": "Tools & Workflow",
  "aboutMe": "About Me",
  "aboutSelfSummary": "Self-summary",
  "aboutDescription": "Full-Stack Developer with 2.5 years of experience, based in Casablanca, Morocco. Motivated and curious professional, determined to deepen technical skills and contribute to a company's success through adaptability. Specialized in web development with .NET Core, Laravel, React and Angular, as well as database architecture and DevOps practices.",
  "phone": "+212 640-376131",
  "email": "moustahsanemustapha@gmail.com",
  "location": "Casablanca, Morocco",
  "portfolio": "https://rb.gy/l9qjbn",
  "contactMe": "Contact Me",
  "experience": "Experience",
  "experience1Title": "Technical Consultant (Hybrid)",
  "experience1Company": "Easy System 3000",
  "experience1Date": "July 2023 - Present",
  "experience1Description": "Development of the sales management application (ADV) for the GECIMMO real estate promotion software suite. Interface integration, development, deployment and maintenance of the database and overall solution.",
  "experience2Title": "Laravel Developer Intern",
  "experience2Company": "Gecimmo",
  "experience2Date": "March 2023 - April 2023",
  "experience2Description": "Development of an external application for managing discount requests. Entry and processing of requests (acceptance/rejection with reasons) according to a predefined process. Generation of detailed reports on applicants and decisions made.",
  "education": "Education",
  "education1Title": "Baccalaureate in Life and Earth Sciences",
  "education1Institution": "Lycée Abdelkrim El Khattabi / Casablanca",
  "education1Description": "Obtaining a baccalaureate represents the culmination of years of effort and determination. It's much more than just a diploma: it's a symbol of perseverance and the will to succeed. This milestone marks the beginning of a new phase, opening the way to many opportunities both academically and professionally.",
  "education2Title": "Diploma of Specialized Technician in Digital Development",
  "education2Institution": "ISTA CFP MGD HASSANIA (DTS)",
  "education2Description": "Obtaining a diploma as a specialized technician in digital development (Fullstack) marks a major step in a technology-focused career. It's the result of intense dedication and a passion for digital innovation. This diploma opens doors to a wide range of professional opportunities, allowing graduates to put their skills into practice to create robust and creative digital solutions.",
  "education3Title": "Professional Bachelor's Degree in DevOps and Full Stack Development",
  "education3Institution": "Faculty of Sciences Ain Chock",
  "education3Description": "Obtaining a Professional Bachelor's Degree in DevOps and Full Stack Development marks a crucial step in a technology-focused career. This diploma testifies to dual expertise, combining web application development skills and DevOps practices for optimized software delivery. It's the result of sustained commitment and rigorous training, opening the way to stimulating professional opportunities in the field of modern software development.",
  "skills": "Skills",
  "skillDescription": "Non enim praesent",
  "awards": "Awards",
  "awardDescription": "Non enim praesent",
  "present": "Present",
  "contactInfo": "Contact Info",
  "contactMailUs": "Mail Us",
  "contactCallUs": "Call Us",
  "contactLocation": "Location",
  "contactSocialInfo": "Social Info",
  "contactLetsWork": "Let's work together.",
  "contactMessageSent": "Your message was sent successfully.",
  "contactName": "Your Name",
  "contactEmail": "Your Email",
  "contactSubject": "Subject",
  "contactMessage": "Your Message",
  "contactSend": "Send Message",
  "serviceMyOfferings": "My Offerings",
  "serviceDbDesign": "Database Design",
  "serviceDbDesignDesc": "Expert database architecture and modeling. I design scalable, normalized database schemas optimized for performance, ensuring data integrity and efficient query execution for your applications.",
  "serviceProjectMgmt": "Project Management",
  "serviceProjectMgmtDesc": "End-to-end project coordination using Agile and Scrum methodologies. I ensure clear communication, on-time deliveries, and smooth collaboration between development teams and stakeholders.",
  "serviceFigma": "Figma Design",
  "serviceFigmaDesc": "Creative UI/UX design using Figma. I craft intuitive, modern interfaces with interactive prototypes, design systems, and responsive layouts that deliver exceptional user experiences.",
  "serviceDevelopment": "Web Development",
  "serviceDevelopmentDesc": "Full-stack web development using modern technologies like Next.js, React, Node.js, and more. I build performant, responsive, and scalable web applications from front-end to back-end.",
  "worksAllProjects": "All Projects",
  "projectAbout": "About",
  "projectYear": "Year",
  "projectClient": "Client",
  "projectServices": "Services",
  "projectType": "Project",
  "projectDescription": "Description",
  "nextProject": "Next Project",
  "viewAllProjects": "View All Projects",
  "project1StudioName": "FieldBook",
  "project1StudioDescription1": "A comprehensive web platform designed to revolutionize the way football enthusiasts book and manage field rentals. The system connects field owners with players through an intuitive, user-friendly interface that simplifies the entire booking process from search to payment.",
  "project1StudioDescription2": "Built with modern web technologies, FieldBook offers real-time availability tracking, secure payment processing, and automated QR code generation for seamless field access. The platform supports both field owners and players with tailored dashboards that provide complete visibility into bookings, revenue, and field utilization.",
  "project1AboutDescription1": "FieldBook is a web-based booking platform that enables users to discover and rent nearby football fields by the hour. The application features a dual-account system catering to both field owners and players, with comprehensive management tools for each user type.",
  "project1AboutDescription2": "Field owners can upload photos, manage availability, and track bookings through an advanced dashboard with detailed statistics. Players can browse available fields, select preferred time slots, make secure bookings, and receive digital receipts with QR codes for entry verification. The system provides real-time booking management and comprehensive analytics for field performance tracking.",
  "project1Client": "Sports Facility Management",
  "project1Services": "Full-Stack Web Development",
  "project1ProjectType": "Booking Platform",
  "project1DetailsDescription1": "The platform features a robust authentication system with two distinct user roles: Field Owners who can manage multiple venues, upload high-quality images, set pricing, and monitor bookings through comprehensive dashboards; and Players who can search for fields based on location, view detailed information including photos and availability, select time slots, complete secure payments, and receive QR-coded digital receipts for field access.",
  "project1DetailsDescription2": "FieldBook integrates advanced features including real-time availability calendars, automated booking confirmation emails, QR code generation for entry verification, payment gateway integration, and comprehensive analytics dashboards. The admin panel provides field owners with insights into booking trends, revenue statistics, peak usage times, and customer demographics, enabling data-driven business decisions and optimized field management.",
  "project2StudioName": "QRMaster",
  "project2StudioDescription1": "QRMaster is a versatile web application designed to simplify the creation, customization, and management of QR codes. It allows users to convert any text, link, or data into a professional QR code with full control over size, colors, and export format.",
  "project2StudioDescription2": "Built with modern web technologies, QRMaster offers an intuitive interface, instant QR code generation, and flexible export options in PNG or SVG. The platform also includes a powerful QR scanning tool that supports both images and live camera input with immediate decoding.",
  "project2AboutDescription1": "QRMaster is a user-friendly QR code management platform designed for individuals and businesses. It enables users to create, customize, and read QR codes within seconds while maintaining full control over design and export settings.",
  "project2AboutDescription2": "Users can generate QR codes from text or URLs, customize size and colors, and download them in PNG or SVG format. The built-in QR reader decodes content from uploaded images or the camera. All actions are automatically stored in history, categorized into 'Generated' and 'Scanned'.",
  "project2Client": "Digital Tooling & Productivity",
  "project2Services": "Full-Stack Web Development & UI/UX",
  "project2ProjectType": "QR Code Generator & Scanner Platform",
  "project2DetailsDescription1": "The platform features a dynamic dashboard that allows precise QR code creation and customization. Users can adjust colors, background styles, size, and export settings. The QR reader efficiently analyzes uploaded images or live camera streams and instantly displays decoded results.",
  "project2DetailsDescription2": "QRMaster automatically saves the full history in the database, separated into two categories: generated QR codes and scanned QR codes. Users can view, manage, or re-download their history at any time. With its modern architecture, the platform provides high performance, clean UI/UX, and full device compatibility.",
  "project3StudioName": "School Management System",
  "project3StudioDescription1": "A comprehensive school management system that handles all academic and administrative operations from A to Z. The system manages teachers, students, attendance, absences, schedules, holidays, exams, grading, and academic records.",
  "project3StudioDescription2": "It centralizes all school activities in one platform to simplify administration and improve organization and communication. Built with modern technologies, this system provides real-time updates, automated notifications, and detailed reporting capabilities for educational institutions.",
  "project3AboutDescription1": "This school management system is designed to streamline all aspects of educational institution management. It provides dedicated modules for teacher management, student enrollment, attendance tracking, academic scheduling, and examination management.",
  "project3AboutDescription2": "The platform offers role-based access for administrators, teachers, and parents, ensuring secure and appropriate access to information. It includes features for absence notifications, grade management, report card generation, and comprehensive analytics for tracking student performance and institutional metrics.",
  "project3Client": "Educational Institution",
  "project3Services": "Full-Stack Enterprise Development",
  "project3ProjectType": "School Management Platform",
  "project3DetailsDescription1": "The system features comprehensive modules including teacher and student management, automated attendance tracking with absence alerts, dynamic schedule management for classes and exams, holiday calendar integration, and a complete grading system with report card generation.",
  "project3DetailsDescription2": "Advanced features include real-time parent notifications, academic performance analytics, attendance statistics, teacher workload management, and automated report generation. The platform supports multiple user roles with customizable permissions, ensuring data security and appropriate access levels for all stakeholders in the educational process.",
  "project4StudioName": "Easy Tasks - Task Management System",
  "project4StudioDescription1": "Easy Tasks is a sophisticated B2B SaaS ticket management platform designed for software development agencies managing multiple client projects. Developed for Gecimmo to efficiently manage tasks, feature requests, and bug tracking across various client engagements.",
  "project4StudioDescription2": "The platform provides role-based access control, multi-stage workflows, automated notifications, and comprehensive tracking of feature requests and bugs across different modules and organizations. It streamlines project management and enhances team collaboration through intelligent task routing and status management.",
  "project4AboutDescription1": "Easy Tasks emphasizes collaboration between clients, project managers, developers, and functional analysts through a well-defined approval and delivery process. The system enables seamless communication and tracking throughout the entire ticket lifecycle.",
  "project4AboutDescription2": "Built with scalability in mind, the platform handles multiple organizations, projects, and modules simultaneously. It features intelligent ticket assignment, priority management, deadline tracking, and comprehensive reporting dashboards that provide real-time insights into project progress and team performance.",
  "project4Client": "Gecimmo / Software Development Agencies",
  "project4Services": "B2B SaaS Platform Development",
  "project4ProjectType": "Ticket Management Platform",
  "project4DetailsDescription1": "The system features role-based access control with distinct permissions for clients, project managers, developers, and functional analysts. It includes multi-stage workflows for ticket approval, development, testing, and delivery. Automated email notifications keep stakeholders informed at each stage of the process.",
  "project4DetailsDescription2": "Advanced capabilities include ticket categorization by type (feature request, bug, enhancement), module-based organization, priority levels with SLA tracking, file attachment support, comment threads for discussions, activity history logging, and customizable status workflows. The platform provides comprehensive analytics on ticket resolution times, team productivity, client satisfaction metrics, and project health indicators, enabling data-driven decision making for project management."
}